Revit 2027 API
UpdaterData.GetDeletedElementIds Method
 Returns set of elements that were deleted from the document. This set is mutually exclusive of elements returned by getAddedElementIds() and getModifiedElementIds().
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetDeletedElementIds()
Public Function GetDeletedElementIds As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetDeletedElementIds()
member GetDeletedElementIds : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
 Set of elements that were deleted from the document and triggered the call to execute() Note: This will only return elements if the trigger registered for the associated updater contains the ChangeType returned by Element::getChangeTypeElementDeletion()
See Also
Reference
UpdaterData Class
Autodesk.Revit.DB Namespace